Autodesk.Revit.DB.Architecture.StairsPathType.StartSymbolTypeId
The start symbol type of stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The startSymbolTypeId is not a valid start symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.ArrowheadTypeId
The arrow head type of the stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The arrowheadTypeId is not a valid arrow head type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013